# SlantedColumnGeometryTreatmentBase Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SlantedColumnGeometryTreatmentBase Property
ParameterTypeId Class See Also
---
"Base Geometry Alignment"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SlantedColumnGeometryTreatmentBase { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SlantedColumnGeometryTreatmentBase As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SlantedColumnGeometryTreatmentBase {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace